Tekla.Structures.Catalogs.BoltItem.BoltItemTypeEnum
Defines the different bolt item types.

Tekla.Structures.Catalogs.BoltItem.BoltItemTypeEnum.BOLT_UNKNOWN
The unknown bolt item type.

Tekla.Structures.Catalogs.BoltItem.BoltItemTypeEnum.BOLT
The bolt type.

Tekla.Structures.Catalogs.BoltItem.BoltItemTypeEnum.STUD
The stud type.